---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertySegmentBearing
source: html/10afeb84-1ab3-cc3a-f7de-1b5c7c57675e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertySegmentBearing Property

"Bearing"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertySegmentBearing { get; }
```